socialNetwork/rebuttal_results/c5.large/sn_large_r200.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 5.825ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 5.484ms, rate sampling interval: 19ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.99ms    2.92ms  15.97ms   88.24%
    Req/Sec   101.41     72.62   315.00     73.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.10ms
 75.000%    5.88ms
 90.000%    8.38ms
 99.000%   15.97ms
 99.900%   28.27ms
 99.990%   35.36ms
 99.999%   36.35ms
100.000%   36.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.219     0.000000            1         1.00
       2.663     0.100000          999         1.11
       2.893     0.200000         1994         1.25
       3.199     0.300000         2978         1.43
       3.661     0.400000         3968         1.67
       4.103     0.500000         4958         2.00
       4.351     0.550000         5462         2.22
       4.655     0.600000         5952         2.50
       4.991     0.650000         6445         2.86
       5.407     0.700000         6940         3.33
       5.879     0.750000         7441         4.00
       6.131     0.775000         7685         4.44
       6.435     0.800000         7933         5.00
       6.791     0.825000         8180         5.71
       7.191     0.850000         8429         6.67
       7.743     0.875000         8675         8.00
       8.031     0.887500         8801         8.89
       8.383     0.900000         8924        10.00
       8.751     0.912500         9048        11.43
       9.247     0.925000         9173        13.33
       9.767     0.937500         9296        16.00
      10.135     0.943750         9359        17.78
      10.551     0.950000         9422        20.00
      10.935     0.956250         9481        22.86
      11.503     0.962500         9543        26.67
      12.167     0.968750         9605        32.00
      12.543     0.971875         9636        35.56
      12.943     0.975000         9669        40.00
      13.239     0.978125         9700        45.71
      13.719     0.981250         9729        53.33
      14.455     0.984375         9761        64.00
      14.911     0.985938         9775        71.11
      15.263     0.987500         9791        80.00
      15.551     0.989062         9806        91.43
      16.287     0.990625         9822       106.67
      16.719     0.992188         9837       128.00
      17.375     0.992969         9845       142.22
      17.935     0.993750         9853       160.00
      18.447     0.994531         9860       182.86
      18.959     0.995313         9868       213.33
      19.935     0.996094         9876       256.00
      20.175     0.996484         9880       284.44
      20.847     0.996875         9884       320.00
      21.839     0.997266         9887       365.71
      22.703     0.997656         9891       426.67
      24.815     0.998047         9895       512.00
      25.071     0.998242         9897       568.89
      26.191     0.998437         9899       640.00
      26.751     0.998633         9901       731.43
      27.135     0.998828         9903       853.33
      28.575     0.999023         9905      1024.00
      28.591     0.999121         9906      1137.78
      29.135     0.999219         9907      1280.00
      29.839     0.999316         9908      1462.86
      29.919     0.999414         9909      1706.67
      31.295     0.999512         9910      2048.00
      31.295     0.999561         9910      2275.56
      33.119     0.999609         9911      2560.00
      33.119     0.999658         9911      2925.71
      33.855     0.999707         9912      3413.33
      33.855     0.999756         9912      4096.00
      33.855     0.999780         9912      4551.11
      35.359     0.999805         9913      5120.00
      35.359     0.999829         9913      5851.43
      35.359     0.999854         9913      6826.67
      35.359     0.999878         9913      8192.00
      35.359     0.999890         9913      9102.22
      36.351     0.999902         9914     10240.00
      36.351     1.000000         9914          inf
#[Mean    =        4.989, StdDeviation   =        2.916]
#[Max     =       36.320, Total count    =         9914]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11918 requests in 1.00m, 2.44MB read
Requests/sec:    198.62
Transfer/sec:     41.70KB