socialNetwork/rebuttal_results/c5.large/sn_large_r300.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 9.048ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 9.313ms, rate sampling interval: 35ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.16ms    6.45ms  31.93ms   89.35%
    Req/Sec   150.66     63.05   314.00     68.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.34ms
 75.000%   10.03ms
 90.000%   15.02ms
 99.000%   31.93ms
 99.900%   62.05ms
 99.990%   96.77ms
 99.999%  102.21ms
100.000%  102.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.231     0.000000            1         1.00
       2.979     0.100000         1489         1.11
       3.767     0.200000         2979         1.25
       4.495     0.300000         4467         1.43
       5.331     0.400000         5958         1.67
       6.335     0.500000         7446         2.00
       6.911     0.550000         8190         2.22
       7.543     0.600000         8936         2.50
       8.215     0.650000         9681         2.86
       9.023     0.700000        10423         3.33
      10.031     0.750000        11168         4.00
      10.567     0.775000        11543         4.44
      11.119     0.800000        11913         5.00
      11.807     0.825000        12286         5.71
      12.623     0.850000        12661         6.67
      13.647     0.875000        13030         8.00
      14.271     0.887500        13217         8.89
      15.015     0.900000        13403        10.00
      15.951     0.912500        13588        11.43
      16.927     0.925000        13776        13.33
      18.143     0.937500        13962        16.00
      18.911     0.943750        14053        17.78
      19.791     0.950000        14146        20.00
      20.703     0.956250        14239        22.86
      21.983     0.962500        14332        26.67
      23.535     0.968750        14425        32.00
      24.591     0.971875        14475        35.56
      25.343     0.975000        14519        40.00
      26.447     0.978125        14566        45.71
      27.551     0.981250        14611        53.33
      29.087     0.984375        14658        64.00
      29.663     0.985938        14681        71.11
      30.351     0.987500        14704        80.00
      31.119     0.989062        14728        91.43
      32.511     0.990625        14751       106.67
      34.527     0.992188        14775       128.00
      36.159     0.992969        14786       142.22
      37.535     0.993750        14797       160.00
      38.431     0.994531        14810       182.86
      40.767     0.995313        14821       213.33
      42.719     0.996094        14832       256.00
      44.319     0.996484        14838       284.44
      45.823     0.996875        14844       320.00
      47.615     0.997266        14850       365.71
      49.919     0.997656        14856       426.67
      51.487     0.998047        14861       512.00
      53.439     0.998242        14864       568.89
      54.175     0.998437        14867       640.00
      56.959     0.998633        14870       731.43
      60.767     0.998828        14873       853.33
      62.751     0.999023        14876      1024.00
      64.671     0.999121        14877      1137.78
      66.111     0.999219        14879      1280.00
      67.839     0.999316        14880      1462.86
      73.343     0.999414        14882      1706.67
      74.431     0.999512        14883      2048.00
      75.711     0.999561        14884      2275.56
      77.119     0.999609        14885      2560.00
      77.119     0.999658        14885      2925.71
      83.327     0.999707        14886      3413.33
      90.879     0.999756        14887      4096.00
      90.879     0.999780        14887      4551.11
      95.359     0.999805        14888      5120.00
      95.359     0.999829        14888      5851.43
      95.359     0.999854        14888      6826.67
      96.767     0.999878        14889      8192.00
      96.767     0.999890        14889      9102.22
      96.767     0.999902        14889     10240.00
      96.767     0.999915        14889     11702.86
      96.767     0.999927        14889     13653.33
     102.207     0.999939        14890     16384.00
     102.207     1.000000        14890          inf
#[Mean    =        8.165, StdDeviation   =        6.451]
#[Max     =      102.144, Total count    =        14890]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17890 requests in 1.00m, 3.67MB read
Requests/sec:    298.14
Transfer/sec:     62.60KB