socialNetwork/rebuttal_results/c5.large/sn_large_r500.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 690.734ms, rate sampling interval: 2478ms
  Thread calibration: mean lat.: 792.840ms, rate sampling interval: 2707ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.30s     2.49s   11.12s    60.78%
    Req/Sec   204.89     13.71   224.00     76.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.27s 
 75.000%    8.38s 
 90.000%    9.56s 
 99.000%   11.12s 
 99.900%   11.73s 
 99.990%   11.83s 
 99.999%   11.84s 
100.000%   11.84s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     710.655     0.000000            1         1.00
    2938.879     0.100000         2055         1.11
    4030.463     0.200000         4106         1.25
    4796.415     0.300000         6164         1.43
    5419.007     0.400000         8215         1.67
    6266.879     0.500000        10268         2.00
    6672.383     0.550000        11301         2.22
    7020.543     0.600000        12316         2.50
    7471.103     0.650000        13338         2.86
    7819.263     0.700000        14368         3.33
    8380.415     0.750000        15399         4.00
    8585.215     0.775000        15908         4.44
    8921.087     0.800000        16425         5.00
    9076.735     0.825000        16935         5.71
    9256.959     0.850000        17449         6.67
    9437.183     0.875000        17968         8.00
    9502.719     0.887500        18249         8.89
    9560.063     0.900000        18477        10.00
    9691.135     0.912500        18731        11.43
    9887.743     0.925000        18985        13.33
   10067.967     0.937500        19243        16.00
   10166.271     0.943750        19367        17.78
   10248.191     0.950000        19511        20.00
   10297.343     0.956250        19624        22.86
   10461.183     0.962500        19760        26.67
   10616.831     0.968750        19881        32.00
   10674.175     0.971875        19948        35.56
   10723.327     0.975000        20011        40.00
   10797.055     0.978125        20076        45.71
   10862.591     0.981250        20143        53.33
   10944.511     0.984375        20201        64.00
   10985.471     0.985938        20237        71.11
   11026.431     0.987500        20269        80.00
   11083.775     0.989062        20301        91.43
   11132.927     0.990625        20334       106.67
   11190.271     0.992188        20362       128.00
   11214.847     0.992969        20379       142.22
   11247.615     0.993750        20392       160.00
   11304.959     0.994531        20408       182.86
   11345.919     0.995313        20428       213.33
   11386.879     0.996094        20444       256.00
   11419.647     0.996484        20449       284.44
   11493.375     0.996875        20456       320.00
   11583.487     0.997266        20464       365.71
   11608.063     0.997656        20473       426.67
   11632.639     0.998047        20485       512.00
   11632.639     0.998242        20485       568.89
   11640.831     0.998437        20491       640.00
   11649.023     0.998633        20492       731.43
   11681.791     0.998828        20496       853.33
   11730.943     0.999023        20500      1024.00
   11739.135     0.999121        20502      1137.78
   11747.327     0.999219        20507      1280.00
   11747.327     0.999316        20507      1462.86
   11755.519     0.999414        20511      1706.67
   11755.519     0.999512        20511      2048.00
   11755.519     0.999561        20511      2275.56
   11804.671     0.999609        20514      2560.00
   11804.671     0.999658        20514      2925.71
   11804.671     0.999707        20514      3413.33
   11821.055     0.999756        20516      4096.00
   11821.055     0.999780        20516      4551.11
   11821.055     0.999805        20516      5120.00
   11829.247     0.999829        20518      5851.43
   11829.247     0.999854        20518      6826.67
   11829.247     0.999878        20518      8192.00
   11829.247     0.999890        20518      9102.22
   11829.247     0.999902        20518     10240.00
   11837.439     0.999915        20520     11702.86
   11837.439     1.000000        20520          inf
#[Mean    =     6300.782, StdDeviation   =     2492.361]
#[Max     =    11829.248, Total count    =        20520]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24801 requests in 1.00m, 5.09MB read
Requests/sec:    413.31
Transfer/sec:     86.78KB